#+TITLE: Simplicity in Go
#+AUTHOR: Am Laher
#+OPTIONS: reveal_center:t reveal_progress:t reveal_history:nil reveal_control:t
#+OPTIONS: reveal_rolling_links:t reveal_keyboard:t reveal_overview:t num:nil
#+OPTIONS: reveal_width:1200 reveal_height:800
#+OPTIONS: reveal_slide_number:c/t
#+OPTIONS: toc:1
#+REVEAL_MARGIN: 0.1
#+REVEAL_MIN_SCALE: 0.5
#+REVEAL_MAX_SCALE: 2.5
#+REVEAL_TRANS: cube
#+REVEAL_THEME: solarized
#+REVEAL_HLEVEL: 2
#+REVEAL_HEAD_PREAMBLE: <meta name="description" content="Simplicity in Go.">
#+REVEAL_POSTAMBLE: <p> Created by am. </p>
#+REVEAL_PLUGINS: (markdown notes)
#+REVEAL_EXTRA_CSS: ./local.css
#+STARTUP: showall

# Local Variables:
# mode: org
# eval: (add-hook 'after-save-hook 'org-reveal-export-to-html t t)
# End:
** Concurrency
    - Don't communicate by sharing memory, share memory by communicating.
    - i.e. Where possible use channels rather than mutexes
    - manage statefulness on a single goroutine
    - Guaranteed delivery. Blocking. (no callbacks)

#+BEGIN_SRC go :imports '("fmt" "time") :results value raw
func say(s string) {
	for i := 0; i < 5; i++ {
		time.Sleep(100 * time.Millisecond)
		fmt.Println(s)
	}
}

func main() {
	go say("world")
	say("hello")
}
#+END_SRC

#+RESULTS:
| hello |
| world |
| hello |
| world |
| world |
| hello |
| world |
| hello |
| hello |

** Marshaling
 - I think Go makes serialization easy, by keeping it simple.
 - Compact - struct tags indicate how to serialize the type
 - This approach used for json, xml, some 3rd party database packages ...

#+BEGIN_SRC go :imports '("encoding/json" "fmt" "os") :results value raw
  type ColorGroup struct {
		ID     int `json:"-"`
		Name   string `json:"nom"`
		Colors []string `json:"colours"`
	}
	group := ColorGroup{
		ID:     1,
		Name:   "Reds",
		Colors: []string{"Crimson", "Red", "Ruby", "Maroon"},
	}
	b, err := json.Marshal(group)
	if err != nil {
		fmt.Println("error:", err)
	}
	os.Stdout.Write(b)
#+END_SRC

#+RESULTS:
{"ID":1,"Name":"Reds","colours":["Crimson","Red","Ruby","Maroon"]}

